# https://basecamp.eolymp.com/uk/problems/130

# Вхідні дані задають координати трьох вершин прямокутника 1, 2, 3
x1, y1, x2, y2, x3, y3 = map(int, input().split())

# Нехай вхідні дані задають координати точок A, B, C
# Нехай кут B = 90 градусів.
# Потрібно визначити яка з заданих вершин 1, 2, 3 відповідає точці В
# Знайдемо, яка з вершин 1, 2, 3 є вершиною з прямим кутом (B)

# Квадрат довжини сторони прямокутника між точками 1 та 2 за теоремою Піфагора
d12 = (x1 - x2) ** 2 + (y1 - y2) ** 2

# Квадрат довжини сторони прямокутника між точками 2 та 3 за теоремою Піфагора
d23 = (x2 - x3) ** 2 + (y2 - y3) ** 2

# Квадрат довжини сторони прямокутника між точками 1 та 3 за теоремою Піфагора
d13 = (x1 - x3) ** 2 + (y1 - y3) ** 2

# Визначимо, яка з трьох відстаней d12, d23, d13 є найбільшою
if d12 > d23 and d12 > d13:
    # Тоді точка B - це точка 3
    xB= x3; yB = y3
    xA = x1; yA = y1
    xC = x2; yC = y2
elif d23 >= d12 and d23 >= d13:
    # Тоді точка B - це точка 1
    xB= x1 
    yB = y1
    xA = x2
    yA = y2
    xC = x3
    yC = y3
else:
    # Тоді точка B - це точка 2
    xB = x2
    yB = y2
    xA = x1
    yA = y1
    xC = x3
    yC = y3

# Тепер ми знаємо координати точок A, B, C
# Тоді координати точки D можна знайти за формулою:
xD = xA + xC - xB
yD = yA + yC - yB

print(xD, yD)
